{
    "books": [
        {
            "author": "Haylock Jobson",
            "desc": "A world abandoned by the gods, mystifying cosmic forces, unimaginable power for those willing to ascend, and a hero who would rather . . . go fishing???\n\nWhen summoned to a fantastical world and granted powers by a broken System, most freshly minted protagonists would strap on their big-boy boots and get ready for their stats to start climbing. But Fischer isn’tlike most MCs. In fact, he doesn’t want to be a hero at all.\n\nFame? Fortune? Power? He had enough of all that in his old life. Discovering forbidden fishing techniques and petting every cute animal that comes within scritching distance? Now that’s a good time.\n\nUnfortunately for Fischer, cosmic forces rarely care for mortal feelings. He’s hounded on all sides by inept cults, conspiring nobles, and more magical misunderstandings than those of a preteen relationship. Even his dutiful pet crab is firing energy blades like an anime antagonist.\n\nSo grab your fishing rod and a good snack, and pet your dog for me. The catch of a lifetime awaits!",
            "genre": "LitRpg",
            "inQueue": [
                {
                    "holdDate": "28-mm-2024",
                    "holdStatus": "active",
                    "username": "frostborn_isolde"
                },
                {
                    "holdDate": "30-mm-2024",
                    "holdStatus": "active",
                    "username": "windrunner"
                }
            ],
            "isAvailable": false,
            "isbn": "B0CVD8D7H6",
            "sect": "",
            "title": "Heretical Fishing : Book 1"
        },
        {
            "author": " Rebecca Yarros",
            "desc": "Enter the brutal and elite world of a war college for dragon riders from #1 New York Times bestselling author Rebecca Yarros\n\nTwenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general—also known as her tough-as-talons mother—has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders.\n\nBut when you’re smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don’t bond to “fragile” humans. They incinerate them.\n\nWith fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother’s daughter—like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant.\n\nShe’ll need every edge her wits can give her just to see the next sunrise.\n\nYet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret.\n\nFriends, enemies, lovers. Everyone at Basgiath War College has an agenda—because once you enter, there are only two ways out: graduate or die.",
            "genre": "Romantasy",
            "inQueue": [
            ],
            "isAvailable": false,
            "isbn": "B0BGDM197Q",
            "sect": "",
            "title": "Fourth Wing (The Empyrean Book 1)"
        },
        {
            "author": "Brandon Sanderson",
            "desc": "Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter.\n\nIt has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them.\n\nOne such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable.\n\nBrightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.\n\nAcross the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.\n\nThe result of over ten years of planning, writing, and world-building, The Way of Kings is but the opening movement of the Stormlight Archive, a bold masterpiece in the making.\n\nSpeak again the ancient oaths:\n\nLife before death.\nStrength before weakness.\nJourney before Destination.\n\nand return to men the Shards they once bore.\n\nThe Knights Radiant must stand again.",
            "genre": "Fantasy",
            "inQueue": [
            ],
            "isAvailable": true,
            "isbn": "9780765326355",
            "sect": "",
            "title": "The Way of Kings: Book One Stormlight Archive"
        },
        {
            "author": "J R R Tolkien",
            "desc": "\"In a hole in the ground there lived a hobbit.\" So begins one of the most beloved and delightful tales in the English language—Tolkien's prelude to The Lord of the Rings. Set in the imaginary world of Middle-earth, at once a classic myth and a modern fairy tale, The Hobbit is one of literature's most enduring and well-loved novels.\nBilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, rarely traveling any farther than his pantry or cellar. But his contentment is disturbed when the wizard Gandalf and a company of dwarves arrive on his doorstep one day to whisk him away on an adventure. They have launched a plot to raid the treasure hoard guarded by Smaug the Magnificent, a large and very dangerous dragon. Bilbo reluctantly joins their quest, unaware that on his journey to the Lonely Mountain he will encounter both a magic ring and a frightening creature known as Gollum.",
            "genre": "Fantasy",
            "inQueue": [
            ],
            "isAvailable": false,
            "isbn": "054792822X",
            "sect": "",
            "title": "The Hobbit"
        },
        {
            "author": "Sarah J. Maas",
            "desc": "Feyre is a huntress. And when she sees a deer in the forest being pursued by a wolf, she kills the predator and takes its prey to feed herself and her family. But the wolf was not what it seemed, and Feyre cannot predict the high price she will have to pay for its death... Dragged away from her family for the murder of a faerie, Feyre discovers that her captor, his face obscured by a jewelled mask, is hiding even more than his piercing green eyes suggest. As Feyre's feelings for Tamlin turn from hostility to passion, she learns that the faerie lands are a far more dangerous place than she realized. And Feyre must fight to break an ancient curse, or she will lose him forever.",
            "genre": "Romantasy",
            "inQueue": [
            ],
            "isAvailable": true,
            "isbn": "1526605392",
            "sect": "",
            "title": "A Court of Thorns and Roses"
        }
    ],
    "users": [
        {
            "account": "20607",
            "activeLoans": [
                {
                    "checkoutDate": "Thu Nov 28 21:25:32 2024",
                    "dueDate": "Sat Dec 28 21:25:32 2024",
                    "isbn": "B0CVD8D7H6"
                },
                {
                    "checkoutDate": "Thu Nov 28 21:25:41 2024",
                    "dueDate": "Sat Dec 28 21:25:41 2024",
                    "isbn": "B0BGDM197Q"
                }
            ],
            "address": "22 Darkhold Castle, Forbidden Forest, Darklands",
            "email": "varek.b@darkarts.com",
            "holdRequests": null,
            "isActive": true,
            "isAdmin": false,
            "name": "Varek Bloodbane",
            "password": "DarkMagic@8745",
            "phone": "+64 27 234 8765",
            "username": "bloodbane_varek"
        },
        {
            "account": "23867",
            "activeLoans": [
                {
                    "checkoutDate": "Fri Nov 29 00:28:37 2024",
                    "dueDate": "Sun Dec 29 00:28:37 2024",
                    "isbn": "054792822X"
                }
            ],
            "address": "34 Icefang Castle, The Frostlands",
            "email": "isolde.f@frostvale.com",
            "holdRequests": [
                {
                    "isbn": "B0CVD8D7H6"
                }
            ],
            "isActive": true,
            "isAdmin": false,
            "name": "Isolde Frostborn",
            "password": "WinterBlood@777",
            "phone": "+64 21 456 982122",
            "username": "frostborn_isolde"
        },
        {
            "account": "100001",
            "address": "City Library",
            "email": "admin@CityLibrary.com",
            "isActive": true,
            "isAdmin": true,
            "name": "The Admin",
            "password": "password",
            "phone": "00000000000",
            "username": "admin"
        },
        {
            "account": "10160",
            "activeLoans": [
            ],
            "address": "Urithiruu",
            "email": "storms@Archive.com",
            "holdRequests": [
            ],
            "isActive": true,
            "isAdmin": false,
            "name": "Kaladin StormBlessed",
            "password": "SylBlade",
            "phone": "02020202020",
            "username": "windrunner"
        }
    ]
}
