{
    "books": [
        {
            "author": "Matt Fraction",
            "desc": "Matt Fraction's all-time great run on Hawkeye, collected entirely in one omnibus!",
            "genre": "Superhero",
            "isbn": "9781302952822",
            "sect": "Comics",
            "title": "Hawkeye"
        },
        {
            "author": "Alice Oseman",
            "desc": "In case you’re wondering, this is not a love story.",
            "genre": "Drama",
            "isbn": "9780007559220",
            "sect": "Young Adults",
            "title": "Solitaire"
        },
        {
            "author": "Anthony Horowitz",
            "desc": "Fourteen-year-old Alex is forcibly recruited into MI6.",
            "genre": "Action",
            "isbn": "9781406360196",
            "sect": "Childrens",
            "title": "Alex Rider #01: Stormbreaker"
        },
        {
            "author": "Haylock Jobson",
            "desc": "When summoned to a fantastical world and granted powers by a broken System, most freshly minted protagonists would strap on their big-boy boots and get ready for their stats to start climbing. But Fischer isn't like most MCs. In fact, he doesn't want to be a hero at all.\nFame? Fortune? Power? He had enough of all that in his old life. Discovering forbidden fishing techniques and petting every cute animal that comes within scritching distance? Now that's a good time.\nUnfortunately for Fischer, cosmic forces rarely care for mortal feelings. He's hounded on all sides by inept cults, conspiring nobles, and more magical misunderstandings than those of a preteen relationship. Even his dutiful pet crab is firing energy blades like an anime antagonist.\nSo grab your fishing rod and a good snack, and pet your dog for me. The catch of a lifetime awaits!",
            "genre": "Fantasy",
            "isbn": "1039453104",
            "sect": "Young Adult",
            "title": "Heretical Fishing Book 1"
        },
        {
            "author": "Rebecca Yarro",
            "desc": "Enter the brutal and elite world of a war college for dragon riders from #1 New York Times bestselling author Rebecca Yarros\nTwenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general--also known as her tough-as-talons mother--has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders.\nBut when you're smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don't bond to \"fragile\" humans. They incinerate them.\nWith fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother's daughter--like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant.\nShe'll need every edge her wits can give her just to see the next sunrise.\nYet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret.\nFriends, enemies, lovers. Everyone at Basgiath War College has an agenda--because once you enter, there are only two ways out: graduate or die.",
            "genre": "Fantasy",
            "isbn": "1649374046",
            "sect": "Adult",
            "title": "Fourth Wing"
        }
    ],
    "users": [
        {
            "account": 123456,
            "address": "1 fake street",
            "email": "email@example.com",
            "isActive": true,
            "isAdmin": true,
            "name": "Mr Admin",
            "password": "password",
            "phone": "021021021",
            "username": "admin"
        },
        {
            "account": 788910,
            "address": "2 faker street",
            "email": "stormlight@gmail.com",
            "isActive": true,
            "isAdmin": false,
            "name": "Kaladin Stormblessed",
            "password": "SylBlade",
            "phone": "44544455544444445",
            "username": "windrunner"
        },
        {
            "account": 9247,
            "address": "22 Silverkeep, Witcher’s Hollow, Kaer Morhen",
            "email": "WhiteWolf@silverblade.com",
            "isActive": true,
            "isAdmin": false,
            "name": "Geralt of Rivia",
            "password": "witcher@905",
            "phone": "+64 22 621 2398",
            "username": "WhiteWolf"
        },
        {
            "account": 27217,
            "address": "12 Rivendell Way, Elvenwood, Middle-Earth",
            "email": "arwen.w@starlight.com",
            "isActive": false,
            "isAdmin": false,
            "name": "Arwen Windwalker",
            "password": "ElvenGrace@2024",
            "phone": "+64 22 377 4859",
            "username": "windwalker_arwen"
        }
    ]
}
