{
    "books": [
        {
            "author": "Haylock Jobson",
            "desc": "A world abandoned by the gods, mystifying cosmic forces, unimaginable power for those willing to ascend, and a hero who would rather . . . go fishing???\n\nWhen summoned to a fantastical world and granted powers by a broken System, most freshly minted protagonists would strap on their big-boy boots and get ready for their stats to start climbing. But Fischer isn’tlike most MCs. In fact, he doesn’t want to be a hero at all.\n\nFame? Fortune? Power? He had enough of all that in his old life. Discovering forbidden fishing techniques and petting every cute animal that comes within scritching distance? Now that’s a good time.\n\nUnfortunately for Fischer, cosmic forces rarely care for mortal feelings. He’s hounded on all sides by inept cults, conspiring nobles, and more magical misunderstandings than those of a preteen relationship. Even his dutiful pet crab is firing energy blades like an anime antagonist.\n\nSo grab your fishing rod and a good snack, and pet your dog for me. The catch of a lifetime awaits!",
            "genre": "LitRpg",
            "inQueue": [
            ],
            "isAvailable": false,
            "isbn": "B0CVD8D7H6",
            "issuedTo": "bondsmith",
            "sect": "Fiction",
            "title": "Heretical Fishing : Book 1"
        },
        {
            "author": "Haylock Jobson",
            "desc": "Fischer has everything he needs in life: blossoming friendships, a menagerie of cute animal companions, a waterfront property with easy access to fishing, and enough coffee to take out a small elephant or a really big dog.\nUnfortunately, Fischer can't catch a break. Cosmic forces? Still throwing curveballs. The bigwigs in the capital? Starting to sniff around his business. Cults? Still culting. Plus, awakened beings are washing up on his shores like flotsam after a storm. And worst of all? His coffee guy ghosted him!\nIt's a lot for one heretical fisherman to handle. Thankfully, Fischer isn't alone. Between his trusty guard crab, a mischievous otter who can wreathe herself in lightning, and an adorable bunny eager to solve every problem with a roundhouse kick, he'll be just fine . . . probably.",
            "genre": "LitRpg",
            "inQueue": [
            ],
            "isAvailable": true,
            "isbn": "1039453139",
            "issuedTo": "",
            "sect": "Fiction",
            "title": "Heretical Fishing : Book 2"
        },
        {
            "author": "Haylock Jobson",
            "desc": "In a world where godhood is within reach for those willing to claw their way to the top, only one man has the resolve to reject power and go . . . fishing? Again?\nTry as he might, Fischer still can't catch a break. Tropica's forces have just perpetrated the fantasyland equivalent of crashing the king's party, kicking over the punch bowl, and making a series of rude gestures on their way out. Unfortunately, they're about to learn firsthand that when you take a bully down to the mat, it's best to make sure they don't get back up.\nBecause their enemies are unearthing long-forgotten powers, and if those dabbling in the resulting destructive chi succeed, they could become even more annoying than the time Corporal Claws hid all of Fischer's pants.\nStill, as troublesome as existential annihilation might be, the hurdles in one's own mind are a lot worse-and Fischer has more than a little debris that needs to be swept off his mental doorstep. With the help of his friends, it might just be time to take out the trash once and for all.",
            "genre": "LitRpg",
            "inQueue": [
            ],
            "isAvailable": true,
            "isbn": "103945318X",
            "issuedTo": "",
            "sect": "Fiction",
            "title": "Heretical Fishing : Book 3"
        },
        {
            "author": "Rebecca Yarros",
            "desc": "Welcome to the brutal and elite world of Basgiath War College, where everyone has an agenda, and every night could be your last . . .\n\nTwenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general - also known as her tough-as-talons mother - has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre: dragon riders.\n\nBut when you're smaller than everyone else and your body is brittle, death is only a heartbeat away . . . because dragons don't bond to 'fragile' humans. They incinerate them.\n\nWith fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother's daughter - like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant.\n\nShe'll need every edge her wits can give her just to see the next sunrise.\n\nYet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret.\n\nAlliances will be forged. Lives will be lost. Traitors will become allies . . . or even lovers. But sleep with one eye open because once you enter, there are only two ways out: graduate or die.",
            "genre": "Fantasy",
            "inQueue": [
            ],
            "isAvailable": true,
            "isbn": "0349437017",
            "issuedTo": "",
            "sect": "Fiction",
            "title": "Fourth Wing: The Empyrean Book 1"
        },
        {
            "author": "Rebecca Yarros",
            "desc": "Everyone expected Violet Sorrengail to die during her first year at Basgiath War College, Violet included. But Threshing was only the first impossible test meant to weed out the weak-willed, the unworthy, and the unlucky.\n\nNow the real training begins, and Violet's already wondering how she'll get through. It's not just that it's grueling and maliciously brutal, or even that it's designed to stretch the riders' capacity for pain beyond endurance. It's the new vice commandant, who's made it his personal mission to teach Violet exactly how powerless she is - unless she betrays the man she loves.\n\nAlthough Violet's body might be weaker and frailer than everyone else's, she still has her wits, and a will of iron. And leadership is forgetting the most important lesson Basgiath has taught her: Dragon riders make their own rules.\n\nBut a determination to survive won't be enough this year.\n\nBecause Violet knows the real secret hidden for centuries at Basgiath War College - and nothing, not even dragon fire, may be enough to save them in the end.",
            "genre": "Fantasy",
            "inQueue": [
            ],
            "isAvailable": true,
            "isbn": "0349437033",
            "issuedTo": "",
            "sect": "Fiction",
            "title": "Iron Flame: The Empyrean Book 2"
        },
        {
            "author": "Brandon Sanderson",
            "desc": "Roshar is a world of stone and storms. Uncanny tempests of incredible power sweep across the rocky terrain so frequently that they have shaped ecology and civilization alike. Animals hide in shells, trees pull in branches, and grass retracts into the soilless ground. Cities are built only where the topography offers shelter.\n\nIt has been centuries since the fall of the ten consecrated orders known as the Knights Radiant, but their Shardblades and Shardplate remain: mystical swords and suits of armor that transform ordinary men into near-invincible warriors. Men trade kingdoms for Shardblades. Wars were fought for them, and won by them.\n\nOne such war rages on a ruined landscape called the Shattered Plains. There, Kaladin, who traded his medical apprenticeship for a spear to protect his little brother, has been reduced to slavery. In a war that makes no sense, where ten armies fight separately against a single foe, he struggles to save his men and to fathom the leaders who consider them expendable.\n\nBrightlord Dalinar Kholin commands one of those other armies. Like his brother, the late king, he is fascinated by an ancient text called The Way of Kings. Troubled by over-powering visions of ancient times and the Knights Radiant, he has begun to doubt his own sanity.\n\nAcross the ocean, an untried young woman named Shallan seeks to train under an eminent scholar and notorious heretic, Dalinar's niece, Jasnah. Though she genuinely loves learning, Shallan's motives are less than pure. As she plans a daring theft, her research for Jasnah hints at secrets of the Knights Radiant and the true cause of the war.",
            "genre": "Fantasy",
            "inQueue": [
            ],
            "isAvailable": true,
            "isbn": "9780765326355",
            "issuedTo": "",
            "sect": "Fiction",
            "title": "The Way of Kings : The Stormlight Archive Book 1"
        }
    ],
    "holds": [
    ],
    "users": [
        {
            "account": "100001",
            "address": "City Library",
            "email": "admin@CityLibrary.com",
            "isActive": true,
            "isAdmin": true,
            "name": "The Admin",
            "password": "password",
            "phone": "0000011111",
            "username": "admin"
        },
        {
            "account": "21620",
            "activeLoans": [
            ],
            "address": "Urithiru",
            "email": "Storms@Archives.com",
            "holdRequests": [
            ],
            "isActive": true,
            "isAdmin": false,
            "name": "Kaladin Stromblessed",
            "password": "SylBlade",
            "phone": "02020202020",
            "username": "windrunner"
        },
        {
            "account": "19132",
            "activeLoans": [
            ],
            "address": "The Sewers",
            "email": "TurtleDad1969@gmail.com",
            "holdRequests": [
            ],
            "isActive": true,
            "isAdmin": false,
            "name": "Master Splinter",
            "password": "pizza",
            "phone": "4555050550",
            "username": "ratmaster"
        },
        {
            "account": "2632",
            "activeLoans": [
                {
                    "checkoutDate": "Mon Dec 16 22:17:21 2024",
                    "dueDate": "15/01/2025",
                    "isbn": "B0CVD8D7H6",
                    "status": "active"
                }
            ],
            "address": "Urithiru",
            "email": "Oathbringer@Storms.com",
            "holdRequests": [
            ],
            "isActive": true,
            "isAdmin": false,
            "name": "Dalinar Kholin",
            "password": "codes",
            "phone": "5555516161616",
            "username": "bondsmith"
        },
        {
            "account": "26",
            "address": "5 Scary Lane, Halloween Town",
            "email": "SandyClaws@Spooky.com",
            "isActive": true,
            "isAdmin": false,
            "name": "Jack Skellington",
            "password": "Boo",
            "phone": "5555101010",
            "username": "pumpkinking"
        }
    ]
}
